#### KeyBasedTreeEntriesLoadContent Members

---

|  |
| --- |
| KeyBasedTreeEntriesLoadContent Class   Methods   Properties   See Also |

The  KeyBasedTreeEntriesLoadContent  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddEntry | Adds one KeyBasedTreeEntry to this KeyBasedTreeEntriesLoadContent, which is used to build a KeyBasedTreeEntries object by BuildEntries function. |
| Public method | BuildEntries | Builds a KeyBasedTreeEntries object. |
| Public method | CanAddEntry | Verifies if the KeyBasedTreeEntry could be added in this KeyBasedTreeEntriesLoadContent. |
| Public method | Dispose | (Inherited from  ExternalResourceLoadContent  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetEntries | Gets a copy of KeyBasedTreeEntries object owned by this KeyBasedTreeEntriesLoadContent object. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetLoadResults | Returns a copy of the KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsEntriesBuilt | Verifies that the KeyBasedTreeEntries object owned by a KeyBasedTreeEntriesLoadContent object is built. |
| Public method | Reset | Clears KeyBasedTreeEntriesLoadContent object, including KeyBasedTreeEntries and KeyBasedTreeEntriesLoadResults, owned by this KeyBasedTreeEntriesLoadContent object. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ExternalResourceLoadContent  .) |
| Public property | LoadStatus | A value to indicate the status of an external resource load operation. IExternalResourceServers should set this in the LoadResource() method. (Inherited from  ExternalResourceLoadContent  .) |
| Public property | Version | The version of the external data that the server is providing in this object. (Inherited from  ExternalResourceLoadContent  .) |

# See Also

KeyBasedTreeEntriesLoadContent Class

Autodesk.Revit.DB Namespace